LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_2_REG.h
/*
 * File:           C:\Users\Leander\Documents\Hardware\Endstufe\SigmaStudio\TestDesign\Output\systemfiles_IC_2_REG.h
 *
 * Created:        Saturday, October 12, 2024 10:36:26 AM
 * Description:    TestDesigndspproj:IC 2 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2024 Analog Devices, Inc. All rights reserved.
 */
#ifndef __SYSTEMFILES_IC_2_REG_H__
#define __SYSTEMFILES_IC_2_REG_H__


/* PLL_CLK_CTRL0  - Registers (IC 2) */
#define REG_PLL_CLK_CTRL0_IC_2_ADDR               0x0
#define REG_PLL_CLK_CTRL0_IC_2_BYTE               1
#define REG_PLL_CLK_CTRL0_IC_2_VALUE              0x5

/* PLL_CLK_CTRL1  - Registers (IC 2) */
#define REG_PLL_CLK_CTRL1_IC_2_ADDR               0x1
#define REG_PLL_CLK_CTRL1_IC_2_BYTE               1
#define REG_PLL_CLK_CTRL1_IC_2_VALUE              0x2A

/* PDN_THRMSENS_CTRL_1  - Registers (IC 2) */
#define REG_PDN_THRMSENS_CTRL_1_IC_2_ADDR         0x2
#define REG_PDN_THRMSENS_CTRL_1_IC_2_BYTE         1
#define REG_PDN_THRMSENS_CTRL_1_IC_2_VALUE        0xA4

/* PDN_CTRL2  - Registers (IC 2) */
#define REG_PDN_CTRL2_IC_2_ADDR                   0x3
#define REG_PDN_CTRL2_IC_2_BYTE                   1
#define REG_PDN_CTRL2_IC_2_VALUE                  0xF8

/* PDN_CTRL3  - Registers (IC 2) */
#define REG_PDN_CTRL3_IC_2_ADDR                   0x4
#define REG_PDN_CTRL3_IC_2_BYTE                   1
#define REG_PDN_CTRL3_IC_2_VALUE                  0xF

/* THRM_TEMP_STAT  - Registers (IC 2) */
#define REG_THRM_TEMP_STAT_IC_2_ADDR              0x5
#define REG_THRM_TEMP_STAT_IC_2_BYTE              0
#define REG_THRM_TEMP_STAT_IC_2_VALUE             0x0

/* DAC_CTRL0  - Registers (IC 2) */
#define REG_DAC_CTRL0_IC_2_ADDR                   0x6
#define REG_DAC_CTRL0_IC_2_BYTE                   1
#define REG_DAC_CTRL0_IC_2_VALUE                  0x13

/* DAC_CTRL1  - Registers (IC 2) */
#define REG_DAC_CTRL1_IC_2_ADDR                   0x7
#define REG_DAC_CTRL1_IC_2_BYTE                   1
#define REG_DAC_CTRL1_IC_2_VALUE                  0x2

/* DAC_CTRL2  - Registers (IC 2) */
#define REG_DAC_CTRL2_IC_2_ADDR                   0x8
#define REG_DAC_CTRL2_IC_2_BYTE                   1
#define REG_DAC_CTRL2_IC_2_VALUE                  0x6

/* DAC_MUTE1  - Registers (IC 2) */
#define REG_DAC_MUTE1_IC_2_ADDR                   0x9
#define REG_DAC_MUTE1_IC_2_BYTE                   1
#define REG_DAC_MUTE1_IC_2_VALUE                  0xF8

/* DAC_MUTE2  - Registers (IC 2) */
#define REG_DAC_MUTE2_IC_2_ADDR                   0xA
#define REG_DAC_MUTE2_IC_2_BYTE                   1
#define REG_DAC_MUTE2_IC_2_VALUE                  0xF

/* DACMSTR_VOL  - Registers (IC 2) */
#define REG_DACMSTR_VOL_IC_2_ADDR                 0xB
#define REG_DACMSTR_VOL_IC_2_BYTE                 1
#define REG_DACMSTR_VOL_IC_2_VALUE                0x20

/* DAC01_VOL  - Registers (IC 2) */
#define REG_DAC01_VOL_IC_2_ADDR                   0xC
#define REG_DAC01_VOL_IC_2_BYTE                   1
#define REG_DAC01_VOL_IC_2_VALUE                  0x0

/* DAC02_VOL  - Registers (IC 2) */
#define REG_DAC02_VOL_IC_2_ADDR                   0xD
#define REG_DAC02_VOL_IC_2_BYTE                   1
#define REG_DAC02_VOL_IC_2_VALUE                  0x0

/* DAC03_VOL  - Registers (IC 2) */
#define REG_DAC03_VOL_IC_2_ADDR                   0xE
#define REG_DAC03_VOL_IC_2_BYTE                   1
#define REG_DAC03_VOL_IC_2_VALUE                  0x0

/* DAC04_VOL  - Registers (IC 2) */
#define REG_DAC04_VOL_IC_2_ADDR                   0xF
#define REG_DAC04_VOL_IC_2_BYTE                   1
#define REG_DAC04_VOL_IC_2_VALUE                  0x0

/* DAC05_VOL  - Registers (IC 2) */
#define REG_DAC05_VOL_IC_2_ADDR                   0x10
#define REG_DAC05_VOL_IC_2_BYTE                   1
#define REG_DAC05_VOL_IC_2_VALUE                  0x0

/* DAC06_VOL  - Registers (IC 2) */
#define REG_DAC06_VOL_IC_2_ADDR                   0x11
#define REG_DAC06_VOL_IC_2_BYTE                   1
#define REG_DAC06_VOL_IC_2_VALUE                  0x0

/* DAC07_VOL  - Registers (IC 2) */
#define REG_DAC07_VOL_IC_2_ADDR                   0x12
#define REG_DAC07_VOL_IC_2_BYTE                   1
#define REG_DAC07_VOL_IC_2_VALUE                  0x0

/* DAC08_VOL  - Registers (IC 2) */
#define REG_DAC08_VOL_IC_2_ADDR                   0x13
#define REG_DAC08_VOL_IC_2_BYTE                   1
#define REG_DAC08_VOL_IC_2_VALUE                  0x0

/* DAC09_VOL  - Registers (IC 2) */
#define REG_DAC09_VOL_IC_2_ADDR                   0x14
#define REG_DAC09_VOL_IC_2_BYTE                   1
#define REG_DAC09_VOL_IC_2_VALUE                  0x0

/* DAC10_VOL  - Registers (IC 2) */
#define REG_DAC10_VOL_IC_2_ADDR                   0x15
#define REG_DAC10_VOL_IC_2_BYTE                   1
#define REG_DAC10_VOL_IC_2_VALUE                  0x0

/* DAC11_VOL  - Registers (IC 2) */
#define REG_DAC11_VOL_IC_2_ADDR                   0x16
#define REG_DAC11_VOL_IC_2_BYTE                   1
#define REG_DAC11_VOL_IC_2_VALUE                  0x0

/* DAC12_VOL  - Registers (IC 2) */
#define REG_DAC12_VOL_IC_2_ADDR                   0x17
#define REG_DAC12_VOL_IC_2_BYTE                   1
#define REG_DAC12_VOL_IC_2_VALUE                  0x0

/* DAC13_VOL  - Registers (IC 2) */
#define REG_DAC13_VOL_IC_2_ADDR                   0x18
#define REG_DAC13_VOL_IC_2_BYTE                   1
#define REG_DAC13_VOL_IC_2_VALUE                  0x0

/* DAC14_VOL  - Registers (IC 2) */
#define REG_DAC14_VOL_IC_2_ADDR                   0x19
#define REG_DAC14_VOL_IC_2_BYTE                   1
#define REG_DAC14_VOL_IC_2_VALUE                  0x0

/* DAC15_VOL  - Registers (IC 2) */
#define REG_DAC15_VOL_IC_2_ADDR                   0x1A
#define REG_DAC15_VOL_IC_2_BYTE                   1
#define REG_DAC15_VOL_IC_2_VALUE                  0x0

/* DAC16_VOL  - Registers (IC 2) */
#define REG_DAC16_VOL_IC_2_ADDR                   0x1B
#define REG_DAC16_VOL_IC_2_BYTE                   1
#define REG_DAC16_VOL_IC_2_VALUE                  0x0

/* CM_SEL_PAD_STRGTH  - Registers (IC 2) */
#define REG_CM_SEL_PAD_STRGTH_IC_2_ADDR           0x1C
#define REG_CM_SEL_PAD_STRGTH_IC_2_BYTE           1
#define REG_CM_SEL_PAD_STRGTH_IC_2_VALUE          0x0

/* DAC_POWER1  - Registers (IC 2) */
#define REG_DAC_POWER1_IC_2_ADDR                  0x1D
#define REG_DAC_POWER1_IC_2_BYTE                  1
#define REG_DAC_POWER1_IC_2_VALUE                 0xAA

/* DAC_POWER2  - Registers (IC 2) */
#define REG_DAC_POWER2_IC_2_ADDR                  0x1E
#define REG_DAC_POWER2_IC_2_BYTE                  1
#define REG_DAC_POWER2_IC_2_VALUE                 0xAA

