LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_2_REG.h
/* DAC_POWER3  - Registers (IC 2) */
#define REG_DAC_POWER3_IC_2_ADDR                  0x1F
#define REG_DAC_POWER3_IC_2_BYTE                  1
#define REG_DAC_POWER3_IC_2_VALUE                 0xAA

/* DAC_POWER4  - Registers (IC 2) */
#define REG_DAC_POWER4_IC_2_ADDR                  0x20
#define REG_DAC_POWER4_IC_2_BYTE                  1
#define REG_DAC_POWER4_IC_2_VALUE                 0xAA


/*
 *
 * Control register's field descriptions
 *
 */

/* PLL_CLK_CTRL0 (IC 2) */
#define R0_PUP_IC_2                               0x1    /* 1b	[0] */
#define R0_MCS_IC_2                               0x2    /* 10b	[2:1] */
#define R0_SOFT_RST_IC_2                          0x0    /* 0b	[3] */
#define R0_XTAL_SET_IC_2                          0x0    /* 00b	[5:4] */
#define R0_PLLIN_IC_2                             0x0    /* 00b	[7:6] */
#define R0_PUP_IC_2_MASK                          0x1
#define R0_PUP_IC_2_SHIFT                         0
#define R0_MCS_IC_2_MASK                          0x6
#define R0_MCS_IC_2_SHIFT                         1
#define R0_SOFT_RST_IC_2_MASK                     0x8
#define R0_SOFT_RST_IC_2_SHIFT                    3
#define R0_XTAL_SET_IC_2_MASK                     0x30
#define R0_XTAL_SET_IC_2_SHIFT                    4
#define R0_PLLIN_IC_2_MASK                        0xC0
#define R0_PLLIN_IC_2_SHIFT                       6

/* PLL_CLK_CTRL1 (IC 2) */
#define R1_CLK_SEL_IC_2                           0x0    /* 0b	[0] */
#define R1_VREF_EN_IC_2                           0x1    /* 1b	[1] */
#define R1_PLL_LOCK_IC_2                          0x0    /* 0b	[2] */
#define R1_PLL_MUTE_IC_2                          0x1    /* 1b	[3] */
#define R1_MCLKO_SEL_IC_2                         0x2    /* 10b	[5:4] */
#define R1_LOPWR_MODE_IC_2                        0x0    /* 00b	[7:6] */
#define R1_CLK_SEL_IC_2_MASK                      0x1
#define R1_CLK_SEL_IC_2_SHIFT                     0
#define R1_VREF_EN_IC_2_MASK                      0x2
#define R1_VREF_EN_IC_2_SHIFT                     1
#define R1_PLL_LOCK_IC_2_MASK                     0x4
#define R1_PLL_LOCK_IC_2_SHIFT                    2
#define R1_PLL_MUTE_IC_2_MASK                     0x8
#define R1_PLL_MUTE_IC_2_SHIFT                    3
#define R1_MCLKO_SEL_IC_2_MASK                    0x30
#define R1_MCLKO_SEL_IC_2_SHIFT                   4
#define R1_LOPWR_MODE_IC_2_MASK                   0xC0
#define R1_LOPWR_MODE_IC_2_SHIFT                  6

/* PDN_THRMSENS_CTRL_1 (IC 2) */
#define R2_VREG_PDN_IC_2                          0x0    /* 0b	[0] */
#define R2_PLL_PDN_IC_2                           0x0    /* 0b	[1] */
#define R2_TS_PDN_IC_2                            0x1    /* 1b	[2] */
#define R2_THRM_GO_IC_2                           0x0    /* 0b	[4] */
#define R2_THRM_MODE_IC_2                         0x1    /* 1b	[5] */
#define R2_THRM_RATE_IC_2                         0x2    /* 10b	[7:6] */
#define R2_VREG_PDN_IC_2_MASK                     0x1
#define R2_VREG_PDN_IC_2_SHIFT                    0
#define R2_PLL_PDN_IC_2_MASK                      0x2
#define R2_PLL_PDN_IC_2_SHIFT                     1
#define R2_TS_PDN_IC_2_MASK                       0x4
#define R2_TS_PDN_IC_2_SHIFT                      2
#define R2_THRM_GO_IC_2_MASK                      0x10
#define R2_THRM_GO_IC_2_SHIFT                     4
#define R2_THRM_MODE_IC_2_MASK                    0x20
#define R2_THRM_MODE_IC_2_SHIFT                   5
#define R2_THRM_RATE_IC_2_MASK                    0xC0
#define R2_THRM_RATE_IC_2_SHIFT                   6

/* PDN_CTRL2 (IC 2) */
#define R3_DAC01_PDN_IC_2                         0x0    /* 0b	[0] */
#define R3_DAC02_PDN_IC_2                         0x0    /* 0b	[1] */
#define R3_DAC03_PDN_IC_2                         0x0    /* 0b	[2] */
#define R3_DAC04_PDN_IC_2                         0x1    /* 1b	[3] */
#define R3_DAC05_PDN_IC_2                         0x1    /* 1b	[4] */
#define R3_DAC06_PDN_IC_2                         0x1    /* 1b	[5] */
#define R3_DAC07_PDN_IC_2                         0x1    /* 1b	[6] */
#define R3_DAC08_PDN_IC_2                         0x1    /* 1b	[7] */
#define R3_DAC01_PDN_IC_2_MASK                    0x1
#define R3_DAC01_PDN_IC_2_SHIFT                   0
#define R3_DAC02_PDN_IC_2_MASK                    0x2
#define R3_DAC02_PDN_IC_2_SHIFT                   1
#define R3_DAC03_PDN_IC_2_MASK                    0x4
#define R3_DAC03_PDN_IC_2_SHIFT                   2
#define R3_DAC04_PDN_IC_2_MASK                    0x8
#define R3_DAC04_PDN_IC_2_SHIFT                   3
#define R3_DAC05_PDN_IC_2_MASK                    0x10
#define R3_DAC05_PDN_IC_2_SHIFT                   4
#define R3_DAC06_PDN_IC_2_MASK                    0x20
#define R3_DAC06_PDN_IC_2_SHIFT                   5
#define R3_DAC07_PDN_IC_2_MASK                    0x40
#define R3_DAC07_PDN_IC_2_SHIFT                   6
#define R3_DAC08_PDN_IC_2_MASK                    0x80
#define R3_DAC08_PDN_IC_2_SHIFT                   7

/* PDN_CTRL3 (IC 2) */
#define R4_DAC09_PDN_IC_2                         0x1    /* 1b	[0] */
#define R4_DAC10_PDN_IC_2                         0x1    /* 1b	[1] */
#define R4_DAC11_PDN_IC_2                         0x1    /* 1b	[2] */
#define R4_DAC12_PDN_IC_2                         0x1    /* 1b	[3] */
#define R4_DAC13_PDN_IC_2                         0x0    /* 0b	[4] */
#define R4_DAC14_PDN_IC_2                         0x0    /* 0b	[5] */
#define R4_DAC15_PDN_IC_2                         0x0    /* 0b	[6] */
#define R4_DAC16_PDN_IC_2                         0x0    /* 0b	[7] */
#define R4_DAC09_PDN_IC_2_MASK                    0x1
#define R4_DAC09_PDN_IC_2_SHIFT                   0
#define R4_DAC10_PDN_IC_2_MASK                    0x2
#define R4_DAC10_PDN_IC_2_SHIFT                   1
#define R4_DAC11_PDN_IC_2_MASK                    0x4
#define R4_DAC11_PDN_IC_2_SHIFT                   2
#define R4_DAC12_PDN_IC_2_MASK                    0x8
#define R4_DAC12_PDN_IC_2_SHIFT                   3
#define R4_DAC13_PDN_IC_2_MASK                    0x10
#define R4_DAC13_PDN_IC_2_SHIFT                   4
#define R4_DAC14_PDN_IC_2_MASK                    0x20
#define R4_DAC14_PDN_IC_2_SHIFT                   5
#define R4_DAC15_PDN_IC_2_MASK                    0x40
#define R4_DAC15_PDN_IC_2_SHIFT                   6
#define R4_DAC16_PDN_IC_2_MASK                    0x80
#define R4_DAC16_PDN_IC_2_SHIFT                   7

/* THRM_TEMP_STAT (IC 2) */
#define R5_TEMP_IC_2                              0x00   /* 00000000b	[7:0] */
#define R5_TEMP_IC_2_MASK                         0xFF
#define R5_TEMP_IC_2_SHIFT                        0

/* DAC_CTRL0 (IC 2) */
#define R6_MMUTE_IC_2                             0x1    /* 1b	[0] */
#define R6_FS_IC_2                                0x1    /* 01b	[2:1] */
#define R6_SAI_IC_2                               0x2    /* 010b	[5:3] */
#define R6_SDATA_FMT_IC_2                         0x0    /* 00b	[7:6] */
#define R6_MMUTE_IC_2_MASK                        0x1
#define R6_MMUTE_IC_2_SHIFT                       0
#define R6_FS_IC_2_MASK                           0x6
#define R6_FS_IC_2_SHIFT                          1
#define R6_SAI_IC_2_MASK                          0x38
#define R6_SAI_IC_2_SHIFT                         3
#define R6_SDATA_FMT_IC_2_MASK                    0xC0
#define R6_SDATA_FMT_IC_2_SHIFT                   6

/* DAC_CTRL1 (IC 2) */
#define R7_SAI_MS_IC_2                            0x0    /* 0b	[0] */
#define R7_BCLK_EDGE_IC_2                         0x1    /* 1b	[1] */
#define R7_BCLK_RATE_IC_2                         0x0    /* 0b	[2] */
#define R7_SAI_MSB_IC_2                           0x0    /* 0b	[4] */
#define R7_LRCLK_POL_IC_2                         0x0    /* 0b	[5] */
#define R7_LRCLK_MODE_IC_2                        0x0    /* 0b	[6] */
#define R7_BCLK_GEN_IC_2                          0x0    /* 0b	[7] */
#define R7_SAI_MS_IC_2_MASK                       0x1
#define R7_SAI_MS_IC_2_SHIFT                      0
#define R7_BCLK_EDGE_IC_2_MASK                    0x2
#define R7_BCLK_EDGE_IC_2_SHIFT                   1
#define R7_BCLK_RATE_IC_2_MASK                    0x4
#define R7_BCLK_RATE_IC_2_SHIFT                   2
#define R7_SAI_MSB_IC_2_MASK                      0x10
#define R7_SAI_MSB_IC_2_SHIFT                     4
#define R7_LRCLK_POL_IC_2_MASK                    0x20
#define R7_LRCLK_POL_IC_2_SHIFT                   5
#define R7_LRCLK_MODE_IC_2_MASK                   0x40
#define R7_LRCLK_MODE_IC_2_SHIFT                  6
#define R7_BCLK_GEN_IC_2_MASK                     0x80
#define R7_BCLK_GEN_IC_2_SHIFT                    7

/* DAC_CTRL2 (IC 2) */
#define R8_DE_EMP_EN_IC_2                         0x0    /* 0b	[0] */
#define R8_DAC_OSR_IC_2                           0x1    /* 1b	[1] */
#define R8_AUTO_MUTE_EN_IC_2                      0x1    /* 1b	[2] */
#define R8_DAC_POL_IC_2                           0x0    /* 0b	[3] */
#define R8_BCLK_TDMC_IC_2                         0x0    /* 0b	[4] */
#define R8_VREG_CTRL_IC_2                         0x0    /* 00b	[6:5] */
#define R8_DE_EMP_EN_IC_2_MASK                    0x1
#define R8_DE_EMP_EN_IC_2_SHIFT                   0
#define R8_DAC_OSR_IC_2_MASK                      0x2
#define R8_DAC_OSR_IC_2_SHIFT                     1
#define R8_AUTO_MUTE_EN_IC_2_MASK                 0x4
#define R8_AUTO_MUTE_EN_IC_2_SHIFT                2
#define R8_DAC_POL_IC_2_MASK                      0x8
#define R8_DAC_POL_IC_2_SHIFT                     3
#define R8_BCLK_TDMC_IC_2_MASK                    0x10
#define R8_BCLK_TDMC_IC_2_SHIFT                   4
#define R8_VREG_CTRL_IC_2_MASK                    0x60
#define R8_VREG_CTRL_IC_2_SHIFT                   5

