LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_2_REG.h
/* DAC_MUTE1 (IC 2) */
#define R9_DAC01_MUTE_IC_2                        0x0    /* 0b	[0] */
#define R9_DAC02_MUTE_IC_2                        0x0    /* 0b	[1] */
#define R9_DAC03_MUTE_IC_2                        0x0    /* 0b	[2] */
#define R9_DAC04_MUTE_IC_2                        0x1    /* 1b	[3] */
#define R9_DAC05_MUTE_IC_2                        0x1    /* 1b	[4] */
#define R9_DAC06_MUTE_IC_2                        0x1    /* 1b	[5] */
#define R9_DAC07_MUTE_IC_2                        0x1    /* 1b	[6] */
#define R9_DAC08_MUTE_IC_2                        0x1    /* 1b	[7] */
#define R9_DAC01_MUTE_IC_2_MASK                   0x1
#define R9_DAC01_MUTE_IC_2_SHIFT                  0
#define R9_DAC02_MUTE_IC_2_MASK                   0x2
#define R9_DAC02_MUTE_IC_2_SHIFT                  1
#define R9_DAC03_MUTE_IC_2_MASK                   0x4
#define R9_DAC03_MUTE_IC_2_SHIFT                  2
#define R9_DAC04_MUTE_IC_2_MASK                   0x8
#define R9_DAC04_MUTE_IC_2_SHIFT                  3
#define R9_DAC05_MUTE_IC_2_MASK                   0x10
#define R9_DAC05_MUTE_IC_2_SHIFT                  4
#define R9_DAC06_MUTE_IC_2_MASK                   0x20
#define R9_DAC06_MUTE_IC_2_SHIFT                  5
#define R9_DAC07_MUTE_IC_2_MASK                   0x40
#define R9_DAC07_MUTE_IC_2_SHIFT                  6
#define R9_DAC08_MUTE_IC_2_MASK                   0x80
#define R9_DAC08_MUTE_IC_2_SHIFT                  7

/* DAC_MUTE2 (IC 2) */
#define R10_DAC09_MUTE_IC_2                       0x1    /* 1b	[0] */
#define R10_DAC10_MUTE_IC_2                       0x1    /* 1b	[1] */
#define R10_DAC11_MUTE_IC_2                       0x1    /* 1b	[2] */
#define R10_DAC12_MUTE_IC_2                       0x1    /* 1b	[3] */
#define R10_DAC13_MUTE_IC_2                       0x0    /* 0b	[4] */
#define R10_DAC14_MUTE_IC_2                       0x0    /* 0b	[5] */
#define R10_DAC15_MUTE_IC_2                       0x0    /* 0b	[6] */
#define R10_DAC16_MUTE_IC_2                       0x0    /* 0b	[7] */
#define R10_DAC09_MUTE_IC_2_MASK                  0x1
#define R10_DAC09_MUTE_IC_2_SHIFT                 0
#define R10_DAC10_MUTE_IC_2_MASK                  0x2
#define R10_DAC10_MUTE_IC_2_SHIFT                 1
#define R10_DAC11_MUTE_IC_2_MASK                  0x4
#define R10_DAC11_MUTE_IC_2_SHIFT                 2
#define R10_DAC12_MUTE_IC_2_MASK                  0x8
#define R10_DAC12_MUTE_IC_2_SHIFT                 3
#define R10_DAC13_MUTE_IC_2_MASK                  0x10
#define R10_DAC13_MUTE_IC_2_SHIFT                 4
#define R10_DAC14_MUTE_IC_2_MASK                  0x20
#define R10_DAC14_MUTE_IC_2_SHIFT                 5
#define R10_DAC15_MUTE_IC_2_MASK                  0x40
#define R10_DAC15_MUTE_IC_2_SHIFT                 6
#define R10_DAC16_MUTE_IC_2_MASK                  0x80
#define R10_DAC16_MUTE_IC_2_SHIFT                 7

/* DACMSTR_VOL (IC 2) */
#define R11_DACMSTR_VOL_IC_2                      0x20   /* 00100000b	[7:0] */
#define R11_DACMSTR_VOL_IC_2_MASK                 0xFF
#define R11_DACMSTR_VOL_IC_2_SHIFT                0

/* DAC01_VOL (IC 2) */
#define R12_DAC01_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R12_DAC01_VOL_IC_2_MASK                   0xFF
#define R12_DAC01_VOL_IC_2_SHIFT                  0

/* DAC02_VOL (IC 2) */
#define R13_DAC02_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R13_DAC02_VOL_IC_2_MASK                   0xFF
#define R13_DAC02_VOL_IC_2_SHIFT                  0

/* DAC03_VOL (IC 2) */
#define R14_DAC03_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R14_DAC03_VOL_IC_2_MASK                   0xFF
#define R14_DAC03_VOL_IC_2_SHIFT                  0

/* DAC04_VOL (IC 2) */
#define R15_DAC04_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R15_DAC04_VOL_IC_2_MASK                   0xFF
#define R15_DAC04_VOL_IC_2_SHIFT                  0

/* DAC05_VOL (IC 2) */
#define R16_DAC05_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R16_DAC05_VOL_IC_2_MASK                   0xFF
#define R16_DAC05_VOL_IC_2_SHIFT                  0

/* DAC06_VOL (IC 2) */
#define R17_DAC06_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R17_DAC06_VOL_IC_2_MASK                   0xFF
#define R17_DAC06_VOL_IC_2_SHIFT                  0

/* DAC07_VOL (IC 2) */
#define R18_DAC07_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R18_DAC07_VOL_IC_2_MASK                   0xFF
#define R18_DAC07_VOL_IC_2_SHIFT                  0

/* DAC08_VOL (IC 2) */
#define R19_DAC08_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R19_DAC08_VOL_IC_2_MASK                   0xFF
#define R19_DAC08_VOL_IC_2_SHIFT                  0

/* DAC09_VOL (IC 2) */
#define R20_DAC09_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R20_DAC09_VOL_IC_2_MASK                   0xFF
#define R20_DAC09_VOL_IC_2_SHIFT                  0

/* DAC10_VOL (IC 2) */
#define R21_DAC10_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R21_DAC10_VOL_IC_2_MASK                   0xFF
#define R21_DAC10_VOL_IC_2_SHIFT                  0

/* DAC11_VOL (IC 2) */
#define R22_DAC11_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R22_DAC11_VOL_IC_2_MASK                   0xFF
#define R22_DAC11_VOL_IC_2_SHIFT                  0

/* DAC12_VOL (IC 2) */
#define R23_DAC12_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R23_DAC12_VOL_IC_2_MASK                   0xFF
#define R23_DAC12_VOL_IC_2_SHIFT                  0

/* DAC13_VOL (IC 2) */
#define R24_DAC13_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R24_DAC13_VOL_IC_2_MASK                   0xFF
#define R24_DAC13_VOL_IC_2_SHIFT                  0

/* DAC14_VOL (IC 2) */
#define R25_DAC14_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R25_DAC14_VOL_IC_2_MASK                   0xFF
#define R25_DAC14_VOL_IC_2_SHIFT                  0

/* DAC15_VOL (IC 2) */
#define R26_DAC15_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R26_DAC15_VOL_IC_2_MASK                   0xFF
#define R26_DAC15_VOL_IC_2_SHIFT                  0

/* DAC16_VOL (IC 2) */
#define R27_DAC16_VOL_IC_2                        0x00   /* 00000000b	[7:0] */
#define R27_DAC16_VOL_IC_2_MASK                   0xFF
#define R27_DAC16_VOL_IC_2_SHIFT                  0

/* CM_SEL_PAD_STRGTH (IC 2) */
#define R28_CM_SEL_IC_2                           0x0    /* 0b	[1] */
#define R28_PAD_DRV_IC_2                          0x0    /* 0b	[5] */
#define R28_CM_SEL_IC_2_MASK                      0x2
#define R28_CM_SEL_IC_2_SHIFT                     1
#define R28_PAD_DRV_IC_2_MASK                     0x20
#define R28_PAD_DRV_IC_2_SHIFT                    5

