LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_2_REG.h
/* DAC_POWER1 (IC 2) */
#define R29_DAC01_POWER_IC_2                      0x2    /* 10b	[1:0] */
#define R29_DAC02_POWER_IC_2                      0x2    /* 10b	[3:2] */
#define R29_DAC03_POWER_IC_2                      0x2    /* 10b	[5:4] */
#define R29_DAC04_POWER_IC_2                      0x2    /* 10b	[7:6] */
#define R29_DAC01_POWER_IC_2_MASK                 0x3
#define R29_DAC01_POWER_IC_2_SHIFT                0
#define R29_DAC02_POWER_IC_2_MASK                 0xC
#define R29_DAC02_POWER_IC_2_SHIFT                2
#define R29_DAC03_POWER_IC_2_MASK                 0x30
#define R29_DAC03_POWER_IC_2_SHIFT                4
#define R29_DAC04_POWER_IC_2_MASK                 0xC0
#define R29_DAC04_POWER_IC_2_SHIFT                6

/* DAC_POWER2 (IC 2) */
#define R30_DAC05_POWER_IC_2                      0x2    /* 10b	[1:0] */
#define R30_DAC06_POWER_IC_2                      0x2    /* 10b	[3:2] */
#define R30_DAC07_POWER_IC_2                      0x2    /* 10b	[5:4] */
#define R30_DAC08_POWER_IC_2                      0x2    /* 10b	[7:6] */
#define R30_DAC05_POWER_IC_2_MASK                 0x3
#define R30_DAC05_POWER_IC_2_SHIFT                0
#define R30_DAC06_POWER_IC_2_MASK                 0xC
#define R30_DAC06_POWER_IC_2_SHIFT                2
#define R30_DAC07_POWER_IC_2_MASK                 0x30
#define R30_DAC07_POWER_IC_2_SHIFT                4
#define R30_DAC08_POWER_IC_2_MASK                 0xC0
#define R30_DAC08_POWER_IC_2_SHIFT                6

/* DAC_POWER3 (IC 2) */
#define R31_DAC09_POWER_IC_2                      0x2    /* 10b	[1:0] */
#define R31_DAC10_POWER_IC_2                      0x2    /* 10b	[3:2] */
#define R31_DAC11_POWER_IC_2                      0x2    /* 10b	[5:4] */
#define R31_DAC12_POWER_IC_2                      0x2    /* 10b	[7:6] */
#define R31_DAC09_POWER_IC_2_MASK                 0x3
#define R31_DAC09_POWER_IC_2_SHIFT                0
#define R31_DAC10_POWER_IC_2_MASK                 0xC
#define R31_DAC10_POWER_IC_2_SHIFT                2
#define R31_DAC11_POWER_IC_2_MASK                 0x30
#define R31_DAC11_POWER_IC_2_SHIFT                4
#define R31_DAC12_POWER_IC_2_MASK                 0xC0
#define R31_DAC12_POWER_IC_2_SHIFT                6

/* DAC_POWER4 (IC 2) */
#define R32_DAC13_POWER_IC_2                      0x2    /* 10b	[1:0] */
#define R32_DAC14_POWER_IC_2                      0x2    /* 10b	[3:2] */
#define R32_DAC15_POWER_IC_2                      0x2    /* 10b	[5:4] */
#define R32_DAC16_POWER_IC_2                      0x2    /* 10b	[7:6] */
#define R32_DAC13_POWER_IC_2_MASK                 0x3
#define R32_DAC13_POWER_IC_2_SHIFT                0
#define R32_DAC14_POWER_IC_2_MASK                 0xC
#define R32_DAC14_POWER_IC_2_SHIFT                2
#define R32_DAC15_POWER_IC_2_MASK                 0x30
#define R32_DAC15_POWER_IC_2_SHIFT                4
#define R32_DAC16_POWER_IC_2_MASK                 0xC0
#define R32_DAC16_POWER_IC_2_SHIFT                6

#endif
